RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Include/gd32h77x_78x_hpdf.h
/* HPDF_FLTYIDATA */
#define HPDF_FLTYIDATA_ICCH             BITS(0,2)                       /*!< inserted channel most recently converted */
#define HPDF_FLTYIDATA_IDTAT            BITS(8,31)                      /*!< inserted group conversion data */

/* HPDF_FLTYRDATA */
#define HPDF_FLTYRDATA_RCCH             BITS(0,2)                       /*!< regular channel most recently converted */
#define HPDF_FLTYRDATA_RCHPDT           BIT(4)                          /*!< regular channel pending data*/
#define HPDF_FLTYRDATA_RDATA            BITS(8,31)                      /*!< regular channel conversion data */

/* HPDF_FLTYTMHT */
#define HPDF_FLTYTMHT_HTBSD             BITS(0,3)                       /*!< high threshold event break signal distribution */
#define HPDF_FLTYTMHT_HTVAL             BITS(8,31)                      /*!< threshold monitor high threshold value */

/* HPDF_FLTYTMLT */
#define HPDF_FLTYTMLT_LTBSD             BITS(0,3)                       /*!< low threshold event break signal distribution */
#define HPDF_FLTYTMLT_LTVAL             BITS(8,31)                      /*!< threshold monitor low threshold value */

/* HPDF_FLTYTMSTAT */
#define HPDF_FLTYTMSTAT_LTF             BITS(0,7)                       /*!< threshold monitor low threshold flag */
#define HPDF_FLTYTMSTAT_HTF             BITS(8,15)                      /*!< threshold monitor high threshold flag */

/* HPDF_FLTYTMFC */
#define HPDF_FLTYTMFC_LTFC              BITS(0,7)                       /*!< clear the threshold monitor low threshold flag */
#define HPDF_FLTYTMFC_HTFC              BITS(8,15)                      /*!< clear the threshold monitor high threshold flag */

/* HPDF_FLTYEMMAX */
#define HPDF_FLTYEMMAX_MAXDC            BITS(0,2)                       /*!< extremes monitor maximum data channel */
#define HPDF_FLTYEMMAX_MAXVAL           BITS(8,31)                      /*!< extremes monitor maximum value */

/* HPDF_FLTYEMMIN */
#define HPDF_FLTYEMMIN_MINDC            BITS(0,2)                       /*!< extremes monitor minimum data channel */
#define HPDF_FLTYEMMIN_MINVAL           BITS(8,31)                      /*!< extremes monitor minimum value */

/* HPDF_FLTYCT */
#define HPDF_FLTYCT_CTCNT               BITS(4,31)                      /*!< conversion time measured by HPDFCLK */

/* HPDF_FLTSUMTMHT */
#define HPDF_FLTSUMTMHT_SHTBSD          BITS(0,3)                       /*!< sum high threshold event break signal distribution */
#define HPDF_FLTSUMTMHT_SHTVAL          BITS(8,31)                      /*!< sum threshold monitor high threshold value */

/* HPDF_FLTSUMTMLT */
#define HPDF_FLTSUMTMLT_SLTBSD          BITS(0,3)                       /*!< sum low threshold event break signal distribution */
#define HPDF_FLTSUMTMLT_SLTVAL          BITS(8,31)                      /*!< sum threshold monitor low threshold value */

/* HPDF_FLTSUMTMSTAT */
#define HPDF_FLTSUMTMSTAT_SLTF          BIT(0)                          /*!< sum threshold monitor low threshold flag */
#define HPDF_FLTSUMTMSTAT_SHTF          BIT(1)                          /*!< sum threshold monitor high threshold flag */
#define HPDF_FLTSUMTMSTAT_STMEOF        BIT(2)                          /*!< sum threshold monitor event occurred flag */

/* HPDF_FLTSUMTMFC */
#define HPDF_FLTSUMTMFC_SLTFC           BIT(0)                          /*!< clear the sum threshold monitor low threshold flag */
#define HPDF_FLTSUMTMFC_SHTFC           BIT(1)                          /*!< clear the sum threshold monitor high threshold flag */

/* HPDF_FLTSUMTMCTL */
#define HPDF_FLTSUMTMCTL_CDASEL         BITS(0,1)                       /*!< conversion data A selection */
#define HPDF_FLTSUMTMCTL_CDBSEL         BITS(2,3)                       /*!< conversion data B selection */
#define HPDF_FLTSUMTMCTL_TMFDASEL       BITS(4,6)                       /*!< tm_filter data A selection */
#define HPDF_FLTSUMTMCTL_TMFDBSEL       BITS(7,9)                       /*!< tm_filter data B selection */
#define HPDF_FLTSUMTMCTL_STMEN          BIT(16)                         /*!< sum threshold monitor enable */
#define HPDF_FLTSUMTMCTL_STMIE          BIT(17)                         /*!< sum threshold monitor interrupt enable */
#define HPDF_FLTSUMTMCTL_STMFM          BIT(18)                         /*!< sum threshold monitor fast mode */

/* constants definitions */
/* parameter struct definitions */
/* channel configuration params */
typedef struct {
    uint32_t data_packing_mode;                 /*!< data packing mode for HPDF_CHXPDI register */
    uint32_t channel_multiplexer;               /*!< channel multiplexer select input data source */
    uint32_t channel_pin_select;                /*!< channel inputs pins selection */
    uint32_t ck_loss_detector;                  /*!< clock loss detector */
    uint32_t malfunction_monitor;               /*!< malfunction monitor */
    uint32_t spi_ck_source;                     /*!< SPI clock source select */
    uint32_t serial_interface;                  /*!< serial interface type */
    int32_t  calibration_offset;                /*!< 24-bit calibration offset */
    uint32_t right_bit_shift;                   /*!< data right bit-shift */
    uint32_t tm_filter;                         /*!< threshold monitor Sinc filter order selection */
    uint32_t tm_filter_oversample;              /*!< threshold monitor filter oversampling rate */
    uint32_t mm_break_signal;                   /*!< malfunction monitor break signal distribution */
    uint32_t mm_counter_threshold;              /*!< malfunction monitor counter threshold */
    uint32_t plsk_value;                        /*!< the number of serial input samples that will be skipped */
} hpdf_channel_parameter_struct;

/* filter configuration params */
typedef struct {
    uint32_t tm_fast_mode;                      /*!< threshold monitor fast mode */
    uint32_t tm_channel;                        /*!< threshold monitor channel */
    int32_t  tm_high_threshold;                 /*!< threshold monitor high threshold */
    int32_t  tm_low_threshold;                  /*!< threshold monitor low threshold value */
    uint32_t extreme_monitor_channel;           /*!< extremes monitor channel */
    uint32_t sinc_filter;                       /*!< sinc filter order */
    uint32_t sinc_oversample;                   /*!< sinc filter oversampling rate */
    uint32_t integrator_oversample;             /*!< integrator oversampling rate */
    uint32_t ht_break_signal;                   /*!< high threshold event break signal distribution */
    uint32_t lt_break_signal;                   /*!< low threshold event break signal distribution */
    uint32_t break_number;                      /*!< the number of threshold/malfunction events that can trigger a break signal */
} hpdf_filter_parameter_struct;

