RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Include/gd32h77x_78x_hpdf.h
/* sum threshold monitor definitions */
/* sum threshold monitor conversion data A definitions */
#define CDASEL(regval)                  (BITS(0,1) & ((uint32_t)(regval) << 0U))        /*!< select conversion data A */
#define DATA_A_FLT0                     CDASEL(0)                                       /*!< conversion data A is from filter0 */
#define DATA_A_FLT1                     CDASEL(1)                                       /*!< conversion data A is from filter1 */
#define DATA_A_FLT2                     CDASEL(2)                                       /*!< conversion data A is from filter2 */
#define DATA_A_FLT3                     CDASEL(3)                                       /*!< conversion data A is from filter3 */

/* sum threshold monitor conversion data B definitions */
#define CDBSEL(regval)                  (BITS(2,3) & ((uint32_t)(regval) << 2U))        /*!< select conversion data B */
#define DATA_B_FLT0                     CDBSEL(0)                                       /*!< conversion data B is from filter0 */
#define DATA_B_FLT1                     CDBSEL(1)                                       /*!< conversion data B is from filter1 */
#define DATA_B_FLT2                     CDBSEL(2)                                       /*!< conversion data B is from filter2 */
#define DATA_B_FLT3                     CDBSEL(3)                                       /*!< conversion data B is from filter3 */

/* sum threshold monitor tm_filter data A definitions */
#define TMFDASEL(regval)                (BITS(4,6) & ((uint32_t)(regval) << 4U))        /*!< select tm_filter data A */
#define DATA_A_CH0                      TMFDASEL(0)                                     /*!< tm_filter data A is from channel0 */
#define DATA_A_CH1                      TMFDASEL(1)                                     /*!< tm_filter data A is from channel1 */
#define DATA_A_CH2                      TMFDASEL(2)                                     /*!< tm_filter data A is from channel2 */
#define DATA_A_CH3                      TMFDASEL(3)                                     /*!< tm_filter data A is from channel3 */
#define DATA_A_CH4                      TMFDASEL(4)                                     /*!< tm_filter data A is from channel4 */
#define DATA_A_CH5                      TMFDASEL(5)                                     /*!< tm_filter data A is from channel5 */
#define DATA_A_CH6                      TMFDASEL(6)                                     /*!< tm_filter data A is from channel6 */
#define DATA_A_CH7                      TMFDASEL(7)                                     /*!< tm_filter data A is from channel7 */

/* sum threshold monitor tm_filter data B definitions */
#define TMFDBSEL(regval)                (BITS(7,9) & ((uint32_t)(regval) << 7U))        /*!< select tm_filter data B */
#define DATA_B_CH0                      TMFDBSEL(0)                                     /*!< tm_filter data B is from channel0 */
#define DATA_B_CH1                      TMFDBSEL(1)                                     /*!< tm_filter data B is from channel1 */
#define DATA_B_CH2                      TMFDBSEL(2)                                     /*!< tm_filter data B is from channel2 */
#define DATA_B_CH3                      TMFDBSEL(3)                                     /*!< tm_filter data B is from channel3 */
#define DATA_B_CH4                      TMFDBSEL(4)                                     /*!< tm_filter data B is from channel4 */
#define DATA_B_CH5                      TMFDBSEL(5)                                     /*!< tm_filter data B is from channel5 */
#define DATA_B_CH6                      TMFDBSEL(6)                                     /*!< tm_filter data B is from channel6 */
#define DATA_B_CH7                      TMFDBSEL(7)                                     /*!< tm_filter data B is from channel7 */

/* sum threshold monitor high threshold event break signal definitions */
#define SHTBSD(regval)                  (BITS(0,3) & ((uint32_t)(regval) << 0U))        /*!< select high threshold event break signal */
#define NO_SUMTM_HT_BREAK               SHTBSD(0)                                       /*!< break signal is not distributed to the sum threshold monitor high threshold event */
#define SUMTM_HT_BREAK0                 SHTBSD(1)                                       /*!< break signal 0 is distributed to the sum threshold monitor high threshold event */
#define SUMTM_HT_BREAK1                 SHTBSD(2)                                       /*!< break signal 1 is distributed to the sum threshold monitor high threshold event */
#define SUMTM_HT_BREAK2                 SHTBSD(4)                                       /*!< break signal 2 is distributed to the sum threshold monitor high threshold event */
#define SUMTM_HT_BREAK3                 SHTBSD(8)                                       /*!< break signal 3 is distributed to the sum threshold monitor high threshold event */

/* sum threshold monitor low threshold event break signal definitions */
#define SLTBSD(regval)                  (BITS(0,3) & ((uint32_t)(regval) << 0U))        /*!< select low threshold event break signal */
#define NO_SUMTM_LT_BREAK               SLTBSD(0)                                       /*!< break signal is not distributed to the sum threshold monitor low threshold event */
#define SUMTM_LT_BREAK0                 SLTBSD(1)                                       /*!< break signal 0 is distributed to the sum threshold monitor low threshold event */
#define SUMTM_LT_BREAK1                 SLTBSD(2)                                       /*!< break signal 1 is distributed to the sum threshold monitor low threshold event */
#define SUMTM_LT_BREAK2                 SLTBSD(4)                                       /*!< break signal 2 is distributed to the sum threshold monitor low threshold event */
#define SUMTM_LT_BREAK3                 SLTBSD(8)                                       /*!< break signal 3 is distributed to the sum threshold monitor low threshold event */

